let pnacota = [
    {
        header: 'Алтак Редок',
        content: 'Земля не существует. Плывёт она в бескрайнем небытии, приближаясь с каждым днём к концу своему, коий не осознаётся ею. Снаружи вращается множество миров, не подвластных воображению. Всякий мир населён Слугами, обитателями миров сих, за оными же наблюдают Владыки, кои суть Древние. Слуги, существующие во всех мирах сих, есть те, кто подвергается и переносит. Все они несчастливы иначе, нежели человеки, но всякий из них остаётся подверженным року и намерениям Владык, губительным для душ их. Лишь поклонение Владыкам может оказать некое слабое влияние на несчастливые судьбы их. Истинное поклонение и последующая жертва могут очистить разум их, делая их рабами тех, кому решили они служить. И сделано сие может быть лишь уничтожением доказательств превосходства своего. Лишь убивая брата, отрицаем мы семью. Лишь убивая родных, возвышаемся мы духовно. Лишь жертвуя родом человеческим, выделяемся из него навеки. Потому лишь, что человек в особенности и Слуги в целом есть создания слишком незначительные, чтоб восхищаться собою, должны они повиноваться высшим созданиям, и принесёт сие вознаграждение им, зависящее от количества теней, населяющих мир. Владыки в каждом мире различны. Иные из них есть лишь порождение ужаса смертного. Ужасающи они, но сущи, и представляют они крайний ужас для непосвящённых и чудесное совершенство для избравших путь поклонения им. Никто не может присутствовать на посвящении Слуги. Должно ему полностью отречься от прежнего жития своего, дабы заново возродиться затем в прежнем теле своём благодаря поклонению образам и подобиям.'
    },
    {
        header: 'Алтак Арок',
        content: 'У всего есть Слуга. Тот, кто ниже, слабее его, кого можно использовать по назначению его как вещь в соответствии с силою её. Солнце служит земле, конь служит человеку. Слуги служат Владыкам. Лишь Древние не служат, лишь у них и даже у Слуг их есть присущее им могущество, превосходящее самое жуткое воображение. Древние властны управлять стихиями, заставлять их служить себе, ибо сами они суть стихии. Слуги же подчинены стихиям, кои и сами служат Слугам в свой черёд, невзирая на служение оных. Дано человеку выжить и очиститься лишь тогда, когда приемлет он судьбу свою и своё назначение в ней. Поклонение Древним есть предельная почесть, предоставленная всякому из нас. Се есть не выбор и не свобода, но долг. Древние есть неоспоримые Владыки наши, никто и ничто не ускользнёт от внимания их, и вовеки желательнее жертвовать собою ради прихода их, нежели жить вне их влияния. Именно с мыслию сею должен быть посвящён и пожертвован всякий из детей наших. Быть может, настанет день тот, когда в Кадафь явится тать из теней, дабы быть пожранным там землероющими чудищами подземными. Кровь затопит навеки предначальные базальтовые плиты. Сколькие из нас завершат блистательно свой круг жизни бесчисленными множествами останков, навсегда заполнившими собою долину Пнакота, усыпанную морем костей, движения коего суть движения исполинских дхолов, размеры коих соответствуют мудрости их и терпению беспредельному в ожидании дня, когда вся земля уподобится морю сему!'
    },
    {
        header: 'Алтак Широк',
        content: 'Древние пребывают на тверди, и в воздухе, и в глубинах морских. Неведомы им границы времени и пространства. Единственная преграда для них есть тюрьма их, сотворённая Старшими. Заточённые там, размышляют они о былой славе своей и о грядущем своём возвращении. Грезит и ждёт Ктулху, убаюкиваемый кошмарами человеческими и ужасами глубин. Р’льех — обитель Его и тюрьма Его, и горе тем, кто пытается сломать печати! Слуги Его множатся, изыскивая плодовитых из дщерей Адама и Хаввы. Вынашивают оные отпрысков Обитателей глубин, частицы самого великого Ктулху, несомые теми. Хастур, явившийся в мир прежде иных Древних, обитает, поверженный, во глубине озера Кхали, что в землях Кхан. Путь к свободе Его сокрыт в глубинах. Спускается Он всё глубже во впадины тюрьмы Своей, дабы отыскать там выход, и станет Он предвозвестником возвращения опустошительного. Недолговечна память та, что не может сохранить воли к отмщению. Но опустошение приидет! Волною неумолимою излиется оно с целию единою — убивать; волною невероятною тысячелетней ненависти и ожидания. Разбушевавшаяся, нахлынет она на всех, живых и мёртвых, тех, кто осмелился созерцать иль восхищаться кем‑то иным, нежели Он! Воистину, не нуждается Хастур в Слугах, в рабах, кои чтили бы существование Его. Возвращение случится, и ужас от него будет таким, что залиет землю в минувшем её, настоящем и грядущем. Весь мир заполнит им Хастур, и всякое сострадание будет чуждо Ему. Йог‑Сотот, обитающий в глубинах времени и пространства, расчленяя время в поисках возможного прохода средь бесконечного числа выходов, предложенных Ему.'
    },
    {
        header: 'Алтак Тзарок',
        content: 'Лишь тогда обладают Древние властию наибольшею, когда страшатся их и поклоняются им. Что смогут сделать они, ежели узнает кто день пробуждения их? Ибо не властно время над Древними, но существует оно для многочисленных Слуг их, преследуемых жестокими и жадными человеками. Иные из них пали жертвою своей судьбы. Во времена минувшие поклонялись им как богам. Ныне же предстают они кошмаром ночными, и память о них истребляется нещадно, как нечестивые свиньи на бойне, и принуждают Старшие слуг своих поклоняться немощным, измысленным богам земным. Печальна судьба Обитателей глубин, грады коих то появляются, то исчезают. Нет больше там слуг их, дабы выстраивать башни и поклоняться владыке их — великому Ктулху. Й’а фхтагн! Что же говорить об Шудд-Мелл, царевне тех, кто роет глубины! Движется Она под твердию с целию единою: защитить малый народ Свой, века переживший. Что станет с башнями из чёрного базальта во граде Её, выстроенными по числу жителей?! Чо-чо, астлантийцы, гипербореи и народы иные исчезли уже со священными знаниями своими. Проклятые учения их навеки уничтожены были приверженцами новой веры. Храмы их разрушены, а предметы поклонения их выставлены на площадях на позор. Какое безбожие! Какое кощунство!..'
    },
    {
        header: 'Бенатх Ктугха',
        content: 'С Фомальгаута соидет молния на землю по призыву чародея: Ктугха ралефф’ка этт Ктугха нува скарак! Следует повторить сие трижды с должным выражением. Писано же сие в скрижалях Цантху. Должно сперва обресть тебе жезл Ктугхи, иначе же обрушится на тебя гнев Того, к кому взываешь ты. Чрез сие не только Ктугха, но и слуги Его, огни безумия, могут быть призваны. Се есть пламенные существа, воспламеняющие всё непрестанными изменениями своими и плавящие сталь наилучшей ковки. Писано сие Ивоною: «Лишь тот, кто жезлом сим владеет, приближен будет Господом огня, Его и слуг Его он сможет испросить о помощи себе. Призвать он должен Господа и принесть Ему жертву таковую, дабы соизволил Он сохранить невредимыми жизнь и душу призывающего». Призвать Ктугху! Се есть безумие, и возможно сие для тебя. Но как можно выжить в испытании сём и какое подношение будет достаточным для Древнего?! Посему привожу я здесь обряд, описанный в Книге Ивоны, не ведая, однако, насколько возможно выполнение его и какова его действенность: «Желобки жертвенника, сотворённого в скале, да будут спускаться к земле. Да пронзит всякую жертву меч Стража, не убивая её, однако. Смерть да будет медленною и мучительною. Повторяющиеся страдания есть воззвания к Древним. Чем более понимают жертвы, что ожидает их, тем более разочаровываются в жизни, и громки и ужасны страдания их. Кровь их да будет выпущена при свете луны полной и безоблачной, и да пропитает она прах земной глубоко.'
    },
    {
        header: 'Бенатх Пнакот',
        content: 'В средоточии небытия расположены пещеры Пнакота. Служат они границами прохода. Небытие и бесконечность! Очертания их непостижимы для человеков. Служившие прежде роду змиечеловеков, пещеры сии позволяли им посещать все стороны света. Не только точкою перехода были пещеры, но началом и концом для всякого из рода змиева. Там пребывал жертвенник их, место, куда отправились их души зловещие, утратив могущество. Речено о сём в древних сказаниях: Во глубине земли, в пещерных вереницах, Й’игГолонак ждёт час, чтоб к жизни возродиться. Он грезит о смертях. Он явится надменно В свой день и миг средь тех, кто должен воротиться. Он хладен, словно лёд. Он странников убийца. В мирах и в пустоте вокруг Пнакота виться Ему предрешено Его же чёрной волей. Но Он её черней. Он к жизни возродится! Именно в пещерах Пнакота плодится род змиечеловеков. Лишь в темнейших подземелиях лабиринта Пнакота могут зачать жёны их, и нигде более. Й’иг‑Голонак, также таящийся в пещерах сих, в самых глубинах лабиринта, на пересечении всех путей, готов ответить на призывы всякого, кто взывает к Нему, и на стоны вожделеющих жён, в коих изливал Он сок свой Змия и Господа.'
    },
    {
        header: 'Бенатх Кхарак',
        content: 'Никогда наука не сможет ни решить, ни объяснить появление существа, пришедшего ниоткуда. Не шесть, не восемь и не тысяча направлений у пространства. Беспредельно оно не в границах своих, но числом направлений, составляющих его. Уровень проникновения разума в тайны вселенной определяется количеством направлений, кои постиг он. Овладение новым направлением позволяет расширить границы путей и чистого разума. Человек обыкновенный существует в пространстве шести направлений и пребывает там, не осознавая направлений иных: минувшего и грядущего, памяти и грёз. Овладев сими четырьмя направлениями, сможет измениться он и приблизить Владык. Перемещаясь средь небытия, способны они повелевать чародеями, словно свет, правящий ими прежде. Колдовство сие — иное, нежели соединение нескольких направлений, соотносящихся с теми, в коих движутся существа сии. Нетрудно призвать человека, ворожа в грёзах. Явится призываемый на зов и воротится затем в свой мир шести направлений. Но кто знает, что может явиться, ежели неумело наложены чары иль ежели чародей не вполне владеет заклятиями! Не приидет ли владеющий ими? К счастию для человеков, сгинули Древние в беспредельности измерений в одночасие. Дабы призвать их, надобно посему исполнить пение крайней сложности, единственно произношение коего может привесть даже сильнейшего из чародеев к самоубиению иль безумию. Лишь союз нескольких чародеев может привесть к успеху в заклинательстве Древних. Невероятные знания могут получить от них чародеи прежде, нежели быть убиенными и пожранными теми, чей нечестивый сон потревожили они, ибо определяет вселенское Равновесие кару соизмеримо с должною наградою. Посему… [окончание свитка отсутствует]'
    },
    {
        header: 'Ерртаг Альях',
        content: 'Важно, дабы избранный был растянут на жертвеннике в железном ошейнике и совершенно обездвижен, дабы было ему невозможно сотворить какое-либо движение. Да позаботится колдун о том, дабы избрать жертву с совершенно здравым рассудком. Таковой жизнерадостный человек испытывает зачастую недоверие к радостям жизни. Когда слова будут произнесены, разочарование и наступление безумия у такового освобождает силу великую. Да начнётся обряд с век, кои да будут полностью отрезаны, дабы можно было быть уверенным, что ничего не пропустит он из дивного действа того, кое ожидает его. Два дня после сего необходимы, дабы зарубцевались раны и не был ослеплён человек кровию своею. Бессонница и испражнения, окружающие его, послужат возникновению у него слабости. Тогда да будет произведено первое отсекновение. Да станет оным оскопление, ибо невозможно призвать Господа в присутствии жертвы, способной к зачатию. Он, Господь, один должен представлять собою грядущее и умножение несчастного рода нашего. Подготовки сей должно хватить для того, дабы обратить жертву к безумию. Буде же в этот миг вдруг не проявится оно, должно применить более жёсткое средство, коим может стать ослепление. Однако не должно вредить частям, производящим речь, без коих Владыка не сможет насладиться криками и стенаниями нового раба. Тогда переидет жажда Его на того, кто призывает, дабы от него получить сии столь сладостные страдания. Да будет свершён обряд в третьей части ночи. Да будет затем удалён жертвенник, и да заменит его девственный прах земной. Да будет Круг широк и окружён ветвями.'
    },
    {
        header: 'Ерртаг Братак',
        content: 'Когда нисходит ночь; когда появляются звёзды; когда наваливается, подобно тьме, тишина необычайная; когда единственный зримый свет отбрасывает далёкие отблески, обильно окрашенные синим; когда ночь сия непроглядная кажется населённою образами, смесию видений и миров неощутимых, — тогда град с тремя источниками предстаёт вблизи. Столь же внезапно возникают врата, сколь очевидным мнилось отсутствие их несколькими мгновениями прежде. Справа от порога находится древнее приспособление, позволяющее всякому переместиться к цели и предмету пути своего, ибо ведомо граду сему, что никто не приходит в сей лабиринт ужасающих образов случайно. Разрушение всего, чем наполняется плоть, означает верное место перехода. Не должно привлекать иль возбуждать алчность тех, кто бродит меж мирами в поисках знака, коий переместил бы их на пути места сего неизмеримого. Жестокому испытанию подверглись бы тогда все исследования и страдания того, кто преуспел в странствиях своих! Разрушение плоти важно, но того важнее освобождение разума. Тот, кто пронизывает внешнюю оболочку, полный ненависти, зависти или, того хуже, сожаления, небрежен, и таковой, несомненно, низвергнет себя самого в преисподнюю, уготованную им для прочих. Иные места останутся для него недоступны, тогда как прочие станут могилою. О чистоте обретаемой, о разума освобождении свидетельствуют столпы те, меж коих являются Древние, дабы поглотить несчастную пищу сию, коею стали все те, чей разум не в силах влачить существование своё без плоти и потрохов. Сокровенное место как образ пустоты и страдания.'
    },
    {
        header: 'Ерртаг Ленг',
        content: 'Слава народам Ленга! Рабам Того, кто платит, палачам врагов его! Всем: мореходам, проводникам, советникам иль наёмникам, и вечному кошмару невинных мечтателей! Число коих видится ими как прекраснейшая из грёз, окрашенная присутствием зловещих демонов. Тот, кто овладеет древним наречием их, почерпнёт в оном новую силу. Тот, кто сумеет сделать их рабами, никогда более не будет грезить как прочие. Тот, кто падёт под их властию, присоединится к немыслимым гребцам, что правят свои галеры из Селефаиса в Телек Аркан, вне чёрных морей. На проклятых землях их пересекаются все времена и все пространства. Безмерно воинственные, без всякого кумира, кроме самоцветов, — посему глаголют иные средь них, что служат они за камения, дабы строить галеры свои меж мирами. Даже аль-Кхеми отказался от намерения покорить их. Воинство Его и чары могучие навеки затерялись средь морей, покуда орды Ленга свирепствовали по всем четырём странам света, подавляя сопротивление. Последнее унижение царственному престолу Его было нанесено в незапамятные времена на горе Н’Гарн, ибо Н’Гарн отдана была Картэ, властителю Ленга. За каждого воина Ленга, павшего в бою — Ктулху знает, сколь были они многочисленны! — отрезаны были десять глав сторонников аль-Кхеми, дабы выстроить огромную стену из черепов, соединившую лес Онга с пустынею Эрагх Пульхат.'
    }
];

let root = document.getElementById('root');

function buttonsGenerator() {
    for (let i = 0; i < pnacota.length; i++) {
        let newButton = document.createElement('div');
        newButton.classList.add('btnPost');
        newButton.innerText = pnacota[i].header;
        root.appendChild(newButton);
    }
}

buttonsGenerator();

let buttonPush = document.querySelectorAll('.btnPost');
for (let i = 0; i < buttonPush.length; i++) {
    buttonPush[i].addEventListener('click', function () { outputShowerModel(this) });
}

function outputShowerModel(cont) {
    let crutch = 0; // сие есть костыль б-гомерзкий, дабы кликание на сам пост не срабатывало, как команда на закрывание страницы
    let model = document.createElement('div');
    model.id = 'model';
    root.appendChild(model);
    let chapter = document.createElement('div');
    chapter.id = 'innerModel';
    let voice = document.createElement('p');
    chapter.appendChild(voice);
    model.appendChild(chapter);
    z = [...buttonPush].indexOf(cont);
    document.querySelector('#innerModel p').innerText = pnacota[z].content;
    model.addEventListener('click', function () { crutcHacker() });
    chapter.addEventListener('click', function () { crutch = 1 });
    function crutcHacker() {
        if (crutch == 0) {
            root.removeChild(model);
        } else {
            crutch = 0;
        }
    }
}


